---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateRail
source: html/ae4e8b30-a31a-15a2-fe20-58584034ac75.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateRail Property

Can't create Railing. Thickness of Rail or Balusters might be too small. If you don't want Balusters, specify "None" for Baluster Shape.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateRail { get; }
```